{
  "100": "Termes i condicions",
  "101": "Política de privacitat",
  "102": "Comunicació xifrada",
  "103": "Podeu enviar-me missatges estàndard així com missatges xifrats. La manera més fàcil d'enviar-me missatges",
  "104": "xifrats",
  "105": "es a través de l'",
  "106": "aplicació Signal Messenger",
  "107": "Fas servir, com jo",
  "108": "ProtonMail",
  "109": "pel teu correu electrònic? Aleshores, no cal que fas res especial i els teus missatges s'encripten automàticament.",
  "110": "Si utilitzes un altre proveïdor de serveis de correu electrònic, pots utilitzar la meva clau pública per xifrar un missatge. Els 16 dígits que veus a la pàgina d'inici són una ",
  "111": "empremta digital",
  "112": "La clau pública completa es pot descarregar a continuació o copiar-la al porta-retalls.",
  "113": "No coneixes PGP? Vols obtenir més informació sobre com xifrar missatges o fitxers?",
  "114": "Llegeix aquí",
  "115": "una introducció",
  "116": "O reserva una consulta amb mi i t'ajudaré en el teu camí.",
  "117": "Descarrega la clau pública",
  "118": "Copia la clau pública",
  "119": "Suport TOR",
  "120": "Aquest lloc web també està disponible a través de la xarxa TOR (The Onion Router). Les connexions mitjançant TOR dificulten molt esbrinar la vostra ubicació i identitat. Guanyes en privadesa, però la càrrega del lloc pot ser més lent.",
  "121": "Per connectar-te mitjançant Tor, fas servir un navegador especial,",
  "122": "Navegador Tor",
  "123": ", o un navegador amb suport integrat per a adreces de Onion com",
  "124": "Brave browser",
  "125": "L'enllaç a Lion Digits és:",
  "126": "També es pot accedir a aquest lloc mitjançant un URL de Tor Onion:",
  "127": "Logotip de Lion Digits",
  "128": "Número d'empresa",
  "129": "Envia un correu electrònic a Joris Raymaekers",
  "130": "Icona de correu electrònic",
  "131": "Truca'm des de Bèlgica",
  "132": "Icona de telèfon de Bèlgica",
  "133": "Truca'm des d'Espanya",
  "134": "Icona del telèfon Espanya",
  "135": "Contacta amb mi mitjançant l'aplicació Signal Messenger",
  "136": "Logotip de l'aplicació Signal Messenger",
  "137": "Contacta amb mi via Skype",
  "138": "Logotip de Skype",
  "139": "Veure el meu perfil a Linked-In",
  "140": "Logotip d'enllaç",
  "141": "Veure el meu perfil a Twitter",
  "142": "Logotip de Twitter",
  "143": "Fes una ullada al codi que estic escrivint a Github",
  "144": "Logotip de Github",
  "145": "Fes una ullada a les meves creacions visuals a Codepen",
  "146": "Logotip de Codepen",
  "147": "Copiar al porta-retalls",
  "148": "Icona de còpia al porta-retalls",
  "149": "Què és això?",
  "150": "Icona de signe d'interrogació",
  "152": "Logotip de l'aplicació Signal Messenger",
  "153": "icona d'enllaç extern",
  "154": "Article introductori de PGP",
  "155": "icona d'enllaç extern",
  "156": "icona de baixada",
  "157": "Icona de còpia al porta-retalls",
  "158": "icona d'enllaç extern",
  "159": "icona d'enllaç extern",
  "160": "Demanar hora",
  "161": "Logotip de Lion Digits",
  "162": "Icona de traducció",
  "163": "Termes i condicions",
  "164": "Última actualització el 01-03-2022",
  "165": "Descarrega els termes i condicions de Lion Digits aquí:",
  "166": "Descarrega els Termes i Condicions",
  "167": "En aquesta pàgina pots llegir els termes i condicions de Lion Digits. Les descripcions d'aquesta pàgina són orientatives. Descarrega els termes i condicions complets per obtenir una visió general completa.",
  "168": "Dades de l'empresa",
  "169": "Lion Digits: consultor TIC i desenvolupador de llocs web, aplicacions web i programari, i disseny gràfic amb domicili social a:",
  "170": "i número d'empresa:",
  "171": "Offertes",
  "172": "Totes les cotitzacions i pressupostos de Lion Digits són totalment sense compromís amb el client.",
  "173": "Els assessoraments, les propostes i les cotitzacions realitzades per Lion Digits es dirigeixen personalment al client. Sense el permís de Lion Digits, no està permès proporcionar-los per a la inspecció a altres parts ni utilitzar-los per avaluar l'oferta.",
  "174": "Lion Digits només està vinculat per les ofertes si el client confirma per escrit l'acceptació de les mateixes en un termini de 14 dies.",
  "175": "Un acord es conclou tan bon punt l'oferta és signada pel client i rebuda per Lion Digits, i tan bon punt s'ha rebut el pagament anticipat del 25% de l'import total.",
  "176": "Només si s'indica a l'oferta que no s'espera cap pagament anticipat, el contracte es conclou tan bon punt el client hagi signat l'oferta.",
  "177": "Garantia",
  "178": "Un període de garantia de 30 dies naturals comença després de l'entrega d'un projecte. Aquest període de garantia permet resoldre errors o errors dins del pressupost.",
  "179": "El dret a la garantia caduca si el client vol accedir a un compte que pugui fer canvis estructurals al lloc web o al codi, com ara un compte de superusuari d'un lloc web, accés al sistema de fitxers principal mitjançant (S)FTP o accés amb drets d'escriptura als sistemes de bases de dades utilitzats.",
  "180": "Les garanties addicionals es poden determinar en el marc d'un contracte de manteniment.",
  "181": "Responsabilitats",
  "182": "En cas d'una deficiència imputable en el compliment de l'acord, Lion Digits només és responsable de la compensació de substitució fins a l'import de la factura. S'exclou qualsevol responsabilitat de Lion Digits per qualsevol altra forma de dany, inclosa la compensació per danys indirectes, danys conseqüents o danys per pèrdua de facturació o beneficis.",
  "183": "Preus",
  "184": "Tots els preus indicats no inclouen l'IVA, llevat que s'indiqui expressament el contrari.",
  "185": "Els desitjos addicionals del client que no s'hagin acordat prèviament donaran lloc a un treball addicional pel qual Lion Digits haurà de ser compensat proporcionalment.",
  "186": "Tots els preus estan indexats anualment, llevat que les parts s'acordin el contrari per escrit.",
  "187": "Pagament",
  "188": "Un cop finalitzada l'encàrrec, Lion Digits enviarà una factura per l'import implicat en l'acord, menys qualsevol avançament pagat prèviament. El client haurà d'abonar l'import degut dins dels 14 dies següents a la data de la factura.",
  "189": "Si el client ha superat el termini de pagament, Lion Digits enviarà un recordatori de pagament. Els costos d'un recordatori, per valor de 30,00 € IVA exclòs, seran a càrrec del client.",
  "190": "Si el client no ha complert les seves obligacions en els 14 dies següents a l'enviament del primer recordatori, el cobrament serà subcontractat. Tots els costos derivats d'això són per compte del client. Si es tracta d'un lloc web o altres serveis en línia, aquests també es desconnectaran després del mateix període superior a 14 dies. Els costos per tornar a connectar el lloc web després són totalment per al client.",
  "191": "Privadesa",
  "192": "Lion Digits recull i tracta les dades personals i de l'empresa que rep del client amb la finalitat de l'execució del contracte, gestió de clients, compres, comptabilitat i activitats de màrqueting directe. Els fonaments legals són l'execució d'un acord, el compliment d'obligacions legals i reglamentàries i/o l'interès legítim.",
  "194": "← Inici",
  "195": "icona de baixada",
  "196": "Llegeix la política de privadesa",
  "199": "Ei, compte!",
  "200": "No hauries d'estar aquí...",
  "201": "Torna",
  "204": "Nou títol aquí.",
  "205": "El vostre lloc web és el camí directe cap a més clients i ingressos",
  "206": "amb Lion Digits vas més ràpid i més lluny.",
  "207": "Demanar hora",
  "208": "Desenvolupament d'aplicacions web amb píxels perfectes y amb atenció especial a les millors pràctiques en HTML5 / CSS3 / JS / ReactJS Native i molt més.",
  "209": "Creació de sistemes de gestió de contingut Wordpress personalitzats i potents i botigues web de comerç electrònic.",
  "210": "Optimització de rendiment i SEO per a una càrrega més ràpida, més conversions i un rendiment de cerca òptim",
  "211": "Emprenedors intel·ligents",
  "212": "saben de la importància d'una presència web ben dissenyada, de com aquesta presentació arribarà al seu públic objectiu i convertirà els clients potencials en",
  "213": "ingressos addicionals",
  "214": "té una àmplia experiència en la creació d'aplicacions web rellevants i fàcils d'utilitzar i li agrada ajudar els emprenedors a superar els seus objectius. Posa't en contacte y demana ara una consulta online sense compromís.",
  "215": "Interessat? Demana hora",
  "216": "Demana ara una reunió online sense cap compromís per explorar la millor manera de treballar junts.",
  "217": "Demanar hora",
  "218": "Vols saber més sobre qui sóc?",
  "219": "Busques competències tècniques en JavaScript, TypeScript, NodeJs, ReactJs i més...?",
  "220": "Llegeix més...",
  "221": "Exemples de coses que ja hem fet...",
  "222": "Aplicació web per enllistar llocs d'acampada a Catalunya. Aquest projecte cobreix tota la \"web stack\": una API de back-end, una aplicació web i una aplicació mòbil per a iOS i Android.",
  "223": "lloc web en directe",
  "224": "fitxa tècnica",
  "225": "Es va crear un nou lloc web per a la marca de cervesa Goudster de Halen, amb una visió general pràctica de la llarga història de la cerveseria i un mòdul per a comandes en línia.",
  "226": "lloc web en directe",
  "227": "La base de clients de la Brasserie Lemmensmolen de Beverlo va obtenir un impuls considerable després de llançar un elegant lloc web amb un mòdul de reserves en línia.",
  "228": "lloc web en directe",
  "229": "Lloc web d'aparador per a l'agència de viatges Clear View Escape",
  "230": "lloc web en directe",
  "231": "fitxa tècnica",
  "232": "Interessat? Demanar hora",
  "233": "Demana ara una reunió online sense cap compromís per explorar la millor manera de treballar junts.",
  "234": "Demanar hora",
  "235": "Icona de triangle",
  "236": "Icona de piràmide",
  "237": "Icona de rellotge de sorra",
  "238": "Foto de Joris Raymaekers",
  "239": "Logotip de JavaScript",
  "240": "JavaScript",
  "241": "Logotip de ReactJs",
  "242": "Reacciona Js",
  "243": "Logotip de TypeScript",
  "244": "TypeScript",
  "245": "Logotip de NodeJs",
  "246": "NodeJs",
  "248": "Video de demostración del sitio web de Catacamp",
  "249": "Visita la web del Catacamp",
  "250": "Catacamp logo",
  "251": "icona d'enllaç extern",
  "252": "Consulta el codi a GitHub",
  "253": "Logotip de Github",
  "255": "Vídeo de demostració del lloc web de Goudster",
  "256": "Visiteu el lloc web de Goudster",
  "257": "Logotip de Goudster",
  "258": "icona d'enllaç extern",
  "259": "Pàgina d'inici Brasserie Lemmensmolen",
  "260": "Pàgina d'inici Brasserie Lemmensmolen",
  "261": "Visita el lloc web de Brasserie Lemmensmolen",
  "262": "Logotip de Lemmensmolen",
  "263": "icona d'enllaç extern",
  "265": "Vídeo de demostració del lloc web de l'agència de viatges",
  "266": "Visita el lloc web Clear View Escape",
  "267": "Logotip de Clear View Escape",
  "268": "icona d'enllaç extern",
  "269": "Veure el codi a Github",
  "270": "Logotip de Github",
  "272": "Lion Digits, desenvolupament web",
  "273": "Política de privacitat",
  "274": "Última actualització el 01-03-2022",
  "275": "| Provisions generals",
  "276": "En aquesta pàgina pots llegir quines dades es recullen quan utilitzes aquest lloc web o interactues amb Lion Digits, per què es recullen aquestes dades i com milloren la teva experiència d'usuari.",
  "277": "Aquesta política de privadesa s'aplica als serveis de Lion Digits. Lion Digits no es fa responsable de les pràctiques de privadesa d'altres llocs i recursos amb els quals entras en contacte a través d'aquest lloc web.",
  "278": "En utilitzar aquest lloc web o en comunicar-se amb Lion Digits, indiques l'acceptació d'aquesta política de privadesa.",
  "279": "Comunicació",
  "280": "Quan ens envies un correu electrònic o altres missatges, podem conservar aquests missatges. Ten en compte que algunes dades (del client) s'han de conservar amb finalitats administratives, legals o de seguretat. De vegades, se te demanarà informació personal addicional que sigui rellevant per a la situació en qüestió. Això fa possible processar les teves preguntes i respondre les vostres sol·licituds. Aquestes dades s'emmagatzemen als servidors segurs propis de Lion Digits o d'un tercer.",
  "281": "Galetes",
  "282": "Cookies funcionals",
  "283": "Aquest lloc web utilitza \"cookies\", petits fitxers de text que es col·loquen al vostre ordinador per ajudar-lo a funcionar millor i més ràpid. Per exemple, per recordar l'elecció de l'idioma.",
  "284": "La majoria dels navegadors estan configurats per acceptar galetes de manera predeterminada, però pots restablir el vostre navegador per rebutjar totes les galetes o per indicar quan s'envia una galeta. Tanmateix, algunes funcions i serveis d'aquest i d'altres llocs web poden no funcionar correctament si les galetes estan desactivades al teu navegador.",
  "285": "Cookies analítiques",
  "286": "Les cookies també es poden utilitzar per analitzar com els usuaris utilitzen el lloc. La informació generada per la cookie sobre el teu ús del lloc web pot ser transferida al servidor segur de Lion Digits o d'un tercer. Aquesta informació s'utilitza per fer un seguiment de com utilitza el lloc web i per compilar informes sobre l'activitat del lloc web.",
  "287": "Aquesta informació només s'utilitzarà per a les finalitats descrites en aquesta política de privadesa.",
  "288": "Contingut incrustat d'altres llocs",
  "289": "La informació d'aquest lloc pot contenir contingut incrustat (per exemple, vídeos, imatges, missatges, etc.). El contingut incrustat d'altres llocs es comporta exactament igual que si el visitant hagués visitat aquest altre lloc. Aquests llocs poden recopilar dades sobre vostè, utilitzar galetes, incrustar un seguiment addicional de tercers i controlar la teva interacció amb aquest contingut incrustat, inclòs l'enregistrament d'interaccions amb el contingut incrustat en aquest lloc.",
  "290": "Accedir a la informació personal i a les dades de contacte",
  "291": "Tots els visitants tenen l'oportunitat de veure, canviar o suprimir tota la informació personal proporcionada a Lion Digits.",
  "292": "correu electrònic",
  "293": "← Inici",
  "296": "Sobre mi...",
  "297": "Joris Raymaekers",
  "298": "La meva primera experiència amb ordinadors i codi informàtic va ser arreglant videojocs defectes a la línia d'ordres MS-DOS,",
  "299": "així fou en aquella època...",
  "300": "En un capítol següent vaig estar actiu com a empleat de logística; llavors l'amor em va portar cap a Catalunya; i un màster en política comparada va portar a un temps al periodisme:",
  "301": "Llibres, roses i llibertat (només en neerlandés)",
  "302": "Una jornada pels carrers de Barcelona per mesurar la temperatura del procés polític català.",
  "303": "doorbraak.be/boeken-rozen-en-vrijheid",
  "304": "Però trec el màxim benefici i el major plaer d'ajudar els altres a alleujar els seus problemes en el món digital. Així lo que una vegada va començar amb la configuració de videojocs, la reparació d'ordinadors i mòbils, ara ha evolucionat cap a la creació d'aplicacions web completes.",
  "305": "Desenvolupar tecnologia i utilitzar-la com a palanca per augmentar el teu impacte personal o empresarial és una cosa amb la qual estic encantat d'ajudar-te.",
  "306": "...trivia",
  "307": "Escriu \"afició\" i descobreix què m'agrada fer quan no estic a l'ordinador. Només has de començar a escriure i a veure què passa...",
  "308": "Toca 4 vegades i esbrina què m'agrada fer quan no estic davant d'un ordinador.",
  "309": "Habilitats tecnològiques",
  "310": "El que puc fer per tu.",
  "312": "Del disseny al codi",
  "313": "desenvolupament front-end",
  "314": "pàgina Github",
  "315": "El desenvolupament (de vegades) va més ràpid si pots basar-te en el treball dels altres. Biblioteques que conec:",
  "316": "exemple",
  "317": "exemple",
  "318": "exemple",
  "319": "La gestió i optimització de tot aquest codi es fa normalment amb una de les eines següents:",
  "320": "exemple",
  "321": "Els dissenys i les animacions visuals es poden fer en tots els colors i configuracions possibles. Es pot trobar una selecció d'exemples i experiments al meu Codepen:",
  "322": "Mini-projectes front-end en Codepen",
  "323": "Les col·leccions inclouen: formularis amb validació del costat del client, galeries d'imatges amb filtratge d'elements DOM, modals i animacions CSS",
  "324": "Perfil Codepen",
  "325": "Aplicacions web de pàgina única y multiplataforma.",
  "326": "desenvolupament amb ReactJs",
  "327": "[Descripció de les habilitats de ReactJs]",
  "328": "Aplicació React Native",
  "329": "Servidors web i API",
  "333": "Gestió de servidors i serveis al núvol",
  "334": "màgia darrere les escenes",
  "335": "La vostra aplicació web ha de ser accessible mitjançant un servidor i un nom de domini. Configurar noms de domini i DNS (Domain Name Servers) amb subdominis, correu electrònic, certificats SSL i possiblement una CDN (Content Delivery Network) és una tasca que pertany a cada lloc web.",
  "336": "La gestió de servidors no és la meva activitat principal, però estic prou familiaritzat amb la configuració i el manteniment de servidors virtuals (VPS) tant per a les aplicacions de NodeJs com per als llocs web de Wordpress. Estic familiaritzat amb el treball amb eines com Nginx (proxy invers), PM2, SSH o contenidors Docker:",
  "337": "exemple",
  "338": "exemple",
  "339": "exemple",
  "342": "Llenguatges de programació i IDE",
  "343": "entorn de desenvolupament",
  "344": "Les aplicacions es desenvolupen mitjançant un entorn de desenvolupament o IDE, entorn de desenvolupament integrat. Una col·lecció de programes i eines per escriure i provar el teu codi.",
  "345": "La meva configuració bàsica consisteix en el subsistema de Windows per a Linux (WSL2) i el codi Visual Studio, complementat amb diverses extensions i complements per, per exemple, Docker, formatar codi (Prettier) o generar suggeriments automàticament (Tabnine AI).",
  "346": "L'IOS d'Apple la tinc en un contenidor Docker separat (sí, es pot: instruccions).",
  "347": "Gestió del codi font: Git, Github i Gitea (allotjat al propi servidor).",
  "348": "Altres llenguatges de programació?",
  "349": "El meu enfocament se centra en JavaScript i per extensió TypeScript. Com a desenvolupador web i creador de Wordpress, naturalment també entras en contacte amb PHP de tant en tant.",
  "351": "Zona de diversió",
  "352": "Bé, prou lectura. A continuació trobaràs una sèrie de mini projectes i jocs que et mantindran entretingut durant una estona. Diverteix-te!",
  "353": "Endevina la bandera",
  "354": "Juga ara",
  "355": "Gestor de tasques",
  "356": "A l'aplicació",
  "357": "Stenographer",
  "358": "A l'aplicació",
  "359": "Patatap",
  "360": "Juga ara",
  "361": "Es presenta al jugador una bandera de país aleatòria i quatre possibles respostes. Intenta triar el correcte. Gestió de l'estat del joc creada amb ReactJs i dades obtingudes de l'API REST Countries.",
  "362": "Aplicació de gestió de treballs d'una sola pàgina amb API JSON personalitzada. Funció principal de la IU: selecciona diversos elements (tecla majúscules), suprima i actualitza una selecció personalitzada de tasques. Aplicació construïda amb NodeJs, Express i MongoDb. Punts finals de l'API per a sol·licituds GET/POST/PUT/DELETE. Sol·licituds AJAX amb jQuery.",
  "363": "\"Amaga un missatge de text en una imatge. Codifiqueu i descodifiqueu una imatge de la vostra elecció. Creada amb Python i ReactJs.",
  "364": "Toca, fes clic o escribe aleatòriament al teu teclat. Cada pulsació de tecla produeix un foc artificial de sons i colors generats aleatòriament. Aplicació construïda amb les biblioteques PaperJs i HowlerJs.",
  "365": "Interessat? Demana hora",
  "366": "Demana ara una reunió online sense cap compromís per explorar la millor manera de treballar junts.",
  "367": "Demanar hora",
  "368": "Foto de Joris Raymaekers",
  "369": "Visita l'arxiu de jocs de MS-DOS",
  "370": "icona d'enllaç extern",
  "371": "Casa Pedrera Barcelona",
  "372": "Logotip de Doorbraak",
  "373": "Logotip de JavaScript",
  "374": "JavaScript",
  "375": "Logotip de ReactJs",
  "376": "Reacciona Js",
  "377": "Logotip de TypeScript",
  "378": "TypeScript",
  "379": "Logotip de NodeJs",
  "380": "NodeJs",
  "381": "",
  "382": "icona d'enllaç extern",
  "383": "Vegeu un exemple a Github",
  "384": "icona d'enllaç extern",
  "385": "Vegeu un exemple a Github",
  "386": "icona d'enllaç extern",
  "387": "Vegeu un exemple a Github",
  "388": "icona d'enllaç extern",
  "389": "Vegeu un exemple a Github",
  "390": "icona d'enllaç extern",
  "391": "Fes una ullada a les meves creacions visuals a Codepen",
  "392": "Instantània del perfil de Codepen",
  "393": "Logotip de Codepen",
  "394": "Veure el fragment de codi al meu perfil de Github",
  "395": "icona d'enllaç extern",
  "396": "Veure el fragment de codi al meu perfil de Github",
  "397": "icona d'enllaç extern",
  "398": "Veure el fragment de codi al meu perfil de Github",
  "399": "icona d'enllaç extern",
  "400": "Fes clic i juga el joc",
  "401": "Endevina el país a partir de la bandera",
  "402": "Detalls tècnics...",
  "403": "Icona de signe d'interrogació",
  "404": "Fes clic i prova l'aplicació",
  "405": "Imatge de l'aplicació Task Manager",
  "406": "Detalls tècnics...",
  "407": "Icona de signe d'interrogació",
  "408": "A l'aplicació",
  "409": "Imatge de l'aplicació Stenographer",
  "410": "Detalls tècnics...",
  "411": "Icona de signe d'interrogació",
  "412": "Fes clic i juga el joc",
  "413": "Imatge de l'aplicació Patatap",
  "414": "Detalls tècnics...",
  "415": "Icona de signe d'interrogació",
  "418": "Llegeix més sobre la política de privadesa,",
  "419": "Pots enviar preguntes o sol·licituds sobre el tractament de les teves dades a través de",
  "420": "o envia una carta a l'adreça següent.",
  "421": "Molts llocs web, com aquest lloc propi, estan dissenyats amb un programa de disseny com AdobeXd o Figma i després es converteixen a codi HTML5, (S)CSS i JavaScript. Es presta especial atenció a un enfocament de primer mòbil i a una divisió lògica del codi en seccions i components. Un exemple de com es veu això a la pràctica es pot trobar al codi font d'aquest lloc web",
  "422": "Lloc web de Lion Digits, de Joris Raymaekers.",
  "423": "aquí",
  "424": "assessorament personalitzat per a la vostra presència al web",
  "425": "creació i gestió de llocs web de Wordpress (amb DIVI o WP-Bakery)",
  "426": "desenvolupament de llocs web amb HTML5/CSS3/JavaScript",
  "427": "aplicacions web multiplataforma amb ReactJs i React Native",
  "428": "Desenvolupament d'aplicacions de servidor JavaScript amb NodeJs",
  "429": "Estàs inclinat tècnicament? A continuació, assegureu-vos de desplaçar-vos, consultar alguns exemples i seguir els enllaços de Github al codi font. Assegureu-vos de navegar per les creacions destacades a Codepen...",
  "430": "Configuració de Nginx:",
  "431": "Configuració de Docker Compose:",
  "432": "Script Bash per a actualitzacions automàtiques de codi al servidor VPS:",
  "433": "Construccions automatitzades i funcions al núvol mitjançant Netlify/AWS:",
  "434": "Gestió de projectes: estic familiaritzat amb solucions empresarials com Jira, però per a projectes personals prefereixo un flux de treball Kanban",
  "435": "Taigà",
  "436": "icona d'enllaç extern",
  "437": "fins que això també canvia.",
  "438": "Python és elogiat amb raó per la seva elegància i senzillesa, i és un llenguatge de programació amb el qual he estat experimentant cada cop més:",
  "439": "exemples a Github",
  "440": "icona d'enllaç extern",
  "441": "Taiga.io, programari de gestió de projectes àgil de codi obert",
  "442": "Proves de Python",
  "443": "Versió 1.0,",
  "444": "Versió 1.0,",
  "445": "(1983, Herk-de-Stad)",
  "446": " A continuació trobareu una visió general de les meves competències tècniques (en llenguatge senzill) i els serveis als quals podeu demanar. En breu:",
  "447": "imatge dels serveis digitals",
  "448": "desenvolupament amb NodeJs",
  "449": " NodeJ és un sòlid entorn d'execució de codi obert per a JavaScript. És un entorn molt versàtil per crear aplicacions que després es poden executar en gairebé qualsevol plataforma. JavaScript és l'idioma del web i mitjançant NodeJs podeu utilitzar el mateix llenguatge de programació tant per a la interfície d'usuari (UI) com per a la lògica del servidor o de les tasques de fons. En combinació amb TypeScript, un superconjunt de JavaScript, NodeJs us permet crear programes molt sòlids i d'alt rendiment: des de servidors web i API REST fins a aplicacions de línia d'ordres i solucions de prova.",
  "450": "Exemples recents de projectes NodeJs",
  "451": " és un mòdul NPM de NodeJs amb una interfície de línia d'ordres que us ajuda a traduir el text dels fitxers HTML existents mitjançant l'API de Google Translate i després integrar-los i gestionar-los al vostre lloc web mitjançant fitxers JSON. La interfície CLI es construeix amb Commander i l'anàlisi d'elements HTML es fa amb Node-HTML-Parser. Aquest programa, amb la documentació adjunta, està disponible com a programari de codi obert al registre NPM: ",
  "452": ".",
  "453": "Traductor de text del lloc web",
  "454": "Consulteu el mòdul NPM a NPMjs.com",
  "455": "WTT",
  "456": " és un projecte construït en NodeJs amb un servidor ExpressJS, una API REST, autenticació amb PassportJS i Redis per a l'emmagatzematge de sessions. Les dades s'emmagatzemen en una base de dades MongoDB amb Mongoose per al modelatge d'objectes (ODM). ",
  "457": " o una versió de demostració de treball mitjançant: ",
  "458": "CataCamp",
  "459": "Veure el codi a Github",
  "460": "Veure a Github",
  "461": "Demo website van CataCamp",
  "462": "mitjançant aquest enllaç"
}
