{
  "100": "Términos y condiciones",
  "101": "Política de privacidad",
  "102": "Comunicación encriptada",
  "106": "app de mensajería Signal",
  "107": "Cuando usas, como yo,",
  "108": "ProtonMail",
  "109": "para tu correo, entonces no tienes que hacer nada especial. El correo electrónico entre usuarios de ProtonMail se cifra automáticamente.",
  "110": "Si utilizas otro proveedor de servicios de correo electrónico, puedes utilizar mi clave pública para cifrar un mensaje. Los 16 caracteres que viste, en la parte inferior de la página de inicio, son parte de la ",
  "111": "huella digital",
  "112": " de mi clave pública. Puedes descargar la clave pública completa a continuación. También puedes copiar mi huella digital completa a través del portapapeles.",
  "113": "¿No estás familiarizado con PGP? ¿Quieres obtener más información sobre cifrar mensajes o archivos?",
  "114": "Lee aquí",
  "115": "una introducción",
  "116": "O reserva una consulta conmigo y te ayudaré en tu camino.",
  "117": "Descargar clave pública",
  "118": "Copia de huella dactilar PGP",
  "119": "Soporte para TOR",
  "120": "Este sitio web también está disponible a través de la red TOR (The Onion Router). Las conexiones a través de TOR hacen que sea muy difícil averiguar su ubicación e identidad. Ganas en privacidad, pero la carga del sitio puede retrasarse.",
  "121": "Para conectarse a través de Tor, utiliza un navegador especial,",
  "122": "Navegador Tor",
  "123": ", o un navegador con soporte incorporado para direcciones Onion como",
  "124": "Brave browser",
  "125": "El enlace a Lion Digits es:",
  "126": "Este sitio también es accesible a través de la Red Tor:",
  "127": "Logotipo de Lion Digits",
  "128": "Número de empresa",
  "129": "Enviar un correo electrónico a Joris Raymaekers",
  "130": "icono de correo electrónico",
  "131": "Llámame desde Bélgica",
  "132": "Icono de teléfono Bélgica",
  "133": "Llámame desde España",
  "134": "Icono de teléfono España",
  "135": "Contáctame a través de la aplicación Signal Messenger",
  "136": "Logotipo de la aplicación Signal Messenger",
  "137": "Contáctame a través de Skype",
  "138": "logotipo de skype",
  "139": "Ver mi perfil en Linked-In",
  "140": "Logotipo de Linked-In",
  "141": "Ver mi perfil en Twitter",
  "142": "logotipo de Twitter",
  "143": "Mira el código que estoy escribiendo en Github",
  "144": "logotipo de Github",
  "145": "Mira mis creaciones visuales en Codepen",
  "146": "logotipo de Codepen",
  "147": "Copiar al portapapeles",
  "148": "icono copiar al portapapeles",
  "149": "¿Qué es esto?",
  "150": "Icono de signo de interrogación",
  "152": "Logotipo de la aplicación Signal Messenger",
  "153": "icono de enlace externo",
  "154": "Artículo de introducción a PGP",
  "155": "icono de enlace externo",
  "156": "icono de descarga",
  "157": "icono copiar al portapapeles",
  "158": "icono de enlace externo",
  "159": "icono de enlace externo",
  "160": "Haz una cita",
  "161": "Logotipo de Lion Digits",
  "162": "icono de traducción",
  "163": "Términos y condiciones",
  "164": "Última actualización el 01-03-2022",
  "165": "Descarga los términos y condiciones de Lion Digits aquí:",
  "166": "Descargar Términos y Condiciones",
  "167": "En esta página puedes leer acerca de los términos y condiciones de Lion Digits. Las descripciones en esta página son indicativas. Descarga los términos y condiciones completos para obtener una descripción completa.",
  "168": "Detalles de la compañía",
  "169": "Lion Digits: Consultor TIC y desarrollador de sitios web, aplicaciones y software web, y diseño gráfico con domicilio social en:",
  "170": "y número de empresa:",
  "171": "Ofertas",
  "172": "Todas las cotizaciones y ofertas de Lion Digits son completamente sin compromiso con respecto al cliente.",
  "173": "Los consejos, propuestas y cotizaciones realizadas por Lion Digits se dirigen personalmente al cliente. Sin el permiso de Lion Digits, no está permitido proporcionarlos para que los inspeccionen otras partes o usarlos para otra cosa que no sea evaluar la oferta.",
  "174": "Lion Digits solo está obligado por las ofertas si el cliente confirma por escrito la aceptación de las mismas dentro de los 14 días.",
  "175": "Se concluye un acuerdo tan pronto como el cliente firma la oferta y Lion Digits la recibe, y tan pronto como se recibe el pago anticipado del 25% del monto total.",
  "176": "Solo si se establece en la cotización que no se espera ningún pago por adelantado, el acuerdo se concluirá tan pronto como la cotización haya sido firmada por el cliente.",
  "177": "Garantía",
  "178": "Un período de garantía de 30 días calendario comienza después de la entrega de un proyecto. Este período de garantía permite solucionar errores o bugs dentro de la oferta.",
  "179": "El derecho a la garantía caduca si el cliente desea acceder a una cuenta que puede realizar cambios estructurales en el sitio web o en el código, como una cuenta de super-usuario de un sitio web, acceso al sistema de archivos central mediante (S)FTP o acceso con derechos de escritura en los sistemas de base de datos utilizados.",
  "180": "Se pueden determinar garantías adicionales en el marco de un contrato de mantenimiento.",
  "181": "Responsabilidades",
  "182": "En el caso de una deficiencia atribuible en el cumplimiento del acuerdo, Lion Digits solo es responsable de la compensación de reemplazo hasta el monto de la factura. Se excluye cualquier responsabilidad de Lion Digits por cualquier otra forma de daño, incluida la compensación por daños indirectos, daños consecuentes o daños debido a la pérdida de ingresos o ganancias.",
  "183": "Precios",
  "184": "Todos los precios indicados no incluyen IVA, a menos que se indique expresamente lo contrario.",
  "185": "Los deseos adicionales del cliente que no se hayan acordado de antemano darán como resultado un trabajo adicional por el cual Lion Digits deberá ser compensado proporcionalmente.",
  "186": "Todos los precios están indexados anualmente, salvo pacto en contrario por escrito entre las partes.",
  "187": "Pago",
  "188": "Después de la finalización de la asignación, Lion Digits enviará una factura por el monto involucrado en el acuerdo, menos cualquier anticipo pagado previamente. El cliente debe pagar el monto adeudado dentro de los 14 días posteriores a la fecha de la factura.",
  "189": "Si el cliente ha excedido el plazo de pago, Lion Digits enviará un recordatorio para el pago. Los costes de un recordatorio, por valor de 30 € sin IVA, serán a cargo del cliente.",
  "190": "Si el cliente no ha cumplido con sus obligaciones dentro de los 14 días siguientes al envío del primer recordatorio, se externalizará el cobro. Todos los gastos resultantes de esto son por cuenta del cliente. Si se trata de un sitio web u otros servicios en línea, estos también se desconectarán después del mismo período de excedencia de 14 días. Los costos por la posibilidad de que el sitio web vuelva a estar en línea después son enteramente para el cliente.",
  "191": "Privacidad",
  "192": "Lion Digits recopila y procesa los datos personales y de la empresa que recibe del cliente con el fin de la ejecución del contrato, gestión de clientes, compras, contabilidad y actividades de marketing directo. Las bases legales son la ejecución de un contrato, el cumplimiento de obligaciones legales y reglamentarias y/o el interés legítimo.",
  "194": "← Inicio",
  "195": "icono de descarga",
  "196": "Lee la política de privacidad",
  "199": "Oye, ¡cuidado!",
  "200": "No deberías estar aquí...",
  "201": "atrás",
  "207": "Haz una cita",
  "211": "Sabios emprendedores",
  "212": "conocen bien la importancia de una presencia web bien diseñada, cómo esa presentación puede atraer a su público objetivo, y convertir a los clientes potenciales en",
  "213": "ingresos adicionales",
  "214": "tiene una amplia experiencia en la creación de aplicaciones web relevantes y fáciles de usar y le encanta ayudar a los empresarios a superar sus objetivos. Ponte en contacto y reserva ahora una consulta online sin compromiso.",
  "218": "¿Quieres saber más sobre quién soy?",
  "219": "¿Buscas competencias técnicas en JavaScript, TypeScript, NodeJs, ReactJs y más...?",
  "220": "Leer más...",
  "222": "Aplicación web de cotización de sitios de camping en Cataluña. Este proyecto cubre todo el 'web stack': una API de back-end, una aplicación web y una aplicación móvil para iOS y Android.",
  "223": "sitio web en vivo",
  "224": "archivo técnico",
  "225": "Se creó un nuevo sitio web para la marca de cerveza Goudster de Halen, con una descripción visual de la larga historia de la cervecería y un módulo para pedidos en línea.",
  "226": "sitio web en vivo",
  "227": "La base de clientes de Brasserie Lemmensmolen en Beverlo recibió un impulso considerable después de lanzar un elegante sitio web con un módulo de reserva online.",
  "228": "sitio web en vivo",
  "229": "Sitio web de exhibición para la agencia de viajes Clear View Escape",
  "230": "sitio web en vivo",
  "231": "archivo técnico",
  "232": "¿Interesado? Haz una cita online",
  "233": "Reserva ahora una reunión online sin compromiso para explorar cómo podemos trabajar juntos.",
  "234": "Haz una cita",
  "235": "Icono de triángulo",
  "236": "Icono de pirámide",
  "237": "icono de reloj de arena",
  "238": "Foto de Joris Raymaekers",
  "239": "logotipo de JavaScript",
  "240": "JavaScript",
  "241": "logotipo de ReactJs",
  "242": "ReactJs",
  "243": "Logotipo de TypeScript",
  "244": "TypeScript",
  "245": "logotipo de NodeJs",
  "246": "NodeJs",
  "248": "Video de demostración del sitio web de Catacamp",
  "249": "Visita el sitio web de Catacamp",
  "250": "Catacamp logo",
  "251": "icono de enlace externo",
  "252": "Ver el código en GitHub",
  "253": "logotipo de Github",
  "255": "Video de demostración del sitio web de Goudster",
  "256": "Visite el sitio web de Goudster",
  "257": "Logotipo de estrella dorada",
  "258": "icono de enlace externo",
  "259": "Página de inicio Brasserie Lemmensmolen",
  "260": "Página de inicio Brasserie Lemmensmolen",
  "261": "Visite el sitio web de Brasserie Lemmensmolen",
  "262": "logotipo de Lemmensmolen",
  "263": "icono de enlace externo",
  "265": "Video de demostración del sitio web de la agencia de viajes",
  "266": "Visite el sitio web de Clear View Escape",
  "267": "Logotipo de Clear View Escape",
  "268": "icono de enlace externo",
  "269": "Ver el código en Github",
  "270": "logotipo de Github",
  "272": "Lion Digits, desarrollo web",
  "273": "Política de privacidad",
  "274": "Última actualización el 01-03-2022",
  "275": "| Provisiones generales",
  "276": "En esta página puedes leer qué datos se recopilan cuando utilizas este sitio web o interactúa con Lion Digits, por qué se recopilan estos datos y cómo mejora tu experiencia de usuario.",
  "277": "Esta política de privacidad se aplica a los servicios de Lion Digits. Lion Digits no se hace responsable de las prácticas de privacidad de otros sitios y recursos con los que entre en contacto a través de este sitio web.",
  "278": "Al usar este sitio web o comunicarse con Lion Digits, tú indicas que aceptas esta política de privacidad.",
  "279": "Comunicación",
  "280": "Cuando nos envías correos electrónicos u otros mensajes, podemos retener esos mensajes. Tenga en cuenta que algunos datos (del cliente) deben conservarse con fines administrativos, legales o de seguridad. A veces se te pedirá información personal adicional que sea relevante para la situación en cuestión. Esto hace posible procesar tus preguntas y responder a tus solicitudes. Estos datos se almacenan en los servidores seguros propios de Lion Digits o en los de un tercero.",
  "281": "Galletas",
  "282": "Cookies funcionales",
  "283": "Este sitio web utiliza \"cookies\", pequeños archivos de texto que se colocan en tu ordenador para ayudar a que el sitio web funcione mejor y más rápido. Por ejemplo, para recordar la elección del idioma.",
  "284": "La mayoría de los navegadores están configurados para aceptar cookies de forma predeterminada, pero puedes restablecer tu navegador para rechazar todas las cookies o para indicar cuándo se envía una cookie. Sin embargo, es posible que algunas características y servicios de este y otros sitios web no funcionen correctamente si las cookies están deshabilitadas en tu navegador.",
  "285": "Cookies analíticas",
  "286": "Las cookies también se pueden utilizar para analizar cómo los usuarios utilizan el sitio. La información que genera la cookie acerca de tu uso del sitio web puede transferirse al servidor seguro propio de Lion Digits o de un tercero. Esta información se utiliza para realizar un seguimiento de cómo utilizas el sitio web y para compilar informes sobre la actividad del sitio web.",
  "287": "Esta información solo se utilizará para los fines descritos en esta política de privacidad.",
  "288": "Contenido incrustado de otros sitios",
  "289": "La información en este sitio puede contener contenido incrustado (por ejemplo, videos, imágenes, mensajes, etc.). El contenido incrustado de otros sitios se comporta exactamente igual que si el visitante hubiera visitado este otro sitio. Estos sitios pueden recopilar datos sobre ti, usar cookies, incrustar un seguimiento adicional de terceros y monitorear tu interacción con ese contenido incrustado, incluida la grabación de interacciones con el contenido incrustado en este sitio.",
  "290": "Acceder a información personal y datos de contacto",
  "291": "Todos los visitantes tienen la oportunidad de ver, cambiar o eliminar toda la información personal proporcionada a Lion Digits.",
  "292": "correo electrónico",
  "293": "← Inicio",
  "296": "Acerca de mí...",
  "297": "Joris Raymaekers",
  "298": "Mi primera experiencia con las computadoras y el código de computadora provino de arreglar videojuegos malhumorados en la línea de comando de MS-DOS,",
  "299": "mira, así fue en aquella época...",
  "301": "Libros, rosas y libertad. (solo neerlandés)",
  "302": "Un día por las calles de Barcelona para medir la temperatura del proceso político catalán.",
  "303": "doorbraak.be/boeken-rozen-en-vrijheid",
  "305": "Desarrollar tecnología y usarla como palanca para aumentar tu impacto personal o comercial es algo en lo que me complace ayudar.",
  "309": "Habilidades tecnológicas",
  "310": "Qué puedo hacer por ti.",
  "312": "Del diseño al código",
  "313": "desarrollo front-end",
  "314": "Página Github",
  "315": "El desarrollo (a veces) va más rápido si puedes basarte en el trabajo de otros. Bibliotecas con las que estoy familiarizado:",
  "316": "ejemplo",
  "317": "ejemplo",
  "318": "ejemplo",
  "319": "Administrar y optimizar todo ese código generalmente se realiza con una de las siguientes herramientas:",
  "320": "ejemplo",
  "321": "Los diseños y las animaciones visuales se pueden realizar en todos los colores y configuraciones posibles. Puede encontrar una selección de ejemplos y experimentos en mi Codepen:",
  "322": "Mini-proyectos front-end en Codepen",
  "323": "Las colecciones incluyen: formularios con validación del lado del cliente, galerías de imágenes con filtrado de elementos DOM, modales y animaciones CSS",
  "324": "Perfil Codepen",
  "329": "Servidores web y API",
  "333": "Gestión de servidores y servicios en la nube",
  "334": "magia detrás de escena",
  "335": "Su aplicación web debe ser accesible a través de un servidor y un nombre de dominio. Configurar nombres de dominio y DNS (Servidores de nombres de dominio) con subdominios, correo electrónico, certificados SSL y posiblemente una CDN (Red de entrega de contenido) es una tarea que pertenece a cada sitio web.",
  "336": "La administración de servidores no es mi actividad principal, pero estoy lo suficientemente familiarizado con la configuración y el mantenimiento de servidores virtuales (VPS) tanto para aplicaciones NodeJs como para sitios web de Wordpress. Estoy familiarizado con el trabajo con herramientas como Nginx (proxy inverso), PM2, SSH o contenedores Docker:",
  "337": "ejemplo",
  "338": "ejemplo",
  "339": "ejemplo",
  "342": "Lenguajes de programación e IDE",
  "343": "entorno de desarrollo",
  "344": "Las aplicaciones se desarrollan utilizando un entorno de desarrollo o IDE, Integrated Development Environment. Una colección de programas y herramientas para escribir y probar tu código.",
  "345": "Mi configuración básica consiste en Windows Subsystem for Linux (WSL2) y Visual Studio Code, complementado con varias extensiones y complementos para, por ejemplo, Docker, formato de código (Prettier) o generación automática de sugerencias (Tabnine AI).",
  "347": "Gestión de código fuente: Git (Git Flow), Github y Gitea (alojado en servidor propio).",
  "348": "¿Otros lenguajes de programación?",
  "349": "Mi atención se centra en JavaScript y, por extensión, en TypeScript. Como desarrollador web y usuario de Wordpress, también entras inevitablement en contacto con PHP de vez en cuando.",
  "351": "Zona de diversión",
  "352": "Bien, basta con tanta lectura. A continuación encontrarás una serie de mini proyectos y juegos que te mantendrán entretenido durante un tiempo. ¡Que te diviertas!",
  "353": "Adivina la bandera",
  "354": "Juega ahora",
  "355": "Administrador de tareas",
  "356": "Ir a la aplicación",
  "357": "Stenographer",
  "358": "Ir a la aplicación",
  "359": "Patatap",
  "360": "Juega ahora",
  "361": "Al jugador se le presenta una bandera de país al azar y cuatro respuestas posibles. Trate de elegir el correcto. Gestión del estado del juego creada con ReactJs y datos obtenidos de la API de países REST.",
  "362": "Aplicación de gestión de tareas de una sola página con API JSON personalizada. Función principal de la interfaz de usuario: selecciona varios elementos (tecla de mayúsculas), elimina y actualiza una selección personalizada de tareas. Aplicación construida con NodeJs, Express y MongoDb. Puntos finales de API para solicitudes GET/POST/PUT/DELETE. Solicitudes AJAX con jQuery.",
  "363": "\"Oculta un mensaje de texto en una imagen. Codifique y decodifique una imagen de tu elección. Construido con Python y ReactJs.",
  "364": "Toque, haz clic o escribe al azar en tu teclado. Cada pulsación de tecla produce un fuego artificial de colores y sonidos generados aleatoriamente. Aplicación construida con las bibliotecas PaperJs y HowlerJs.",
  "368": "Foto de Joris Raymaekers",
  "369": "Visite el archivo de juegos de MS-DOS",
  "370": "icono de enlace externo",
  "371": "Casa Pedrera Barcelona",
  "372": "Logotipo de Doorbraak",
  "373": "logotipo de JavaScript",
  "374": "JavaScript",
  "375": "logotipo de ReactJs",
  "376": "ReactJs",
  "377": "Logotipo de TypeScript",
  "378": "TypeScript",
  "379": "logotipo de NodeJs",
  "380": "NodeJs",
  "381": "",
  "382": "icono de enlace externo",
  "383": "Ver un ejemplo en Github",
  "384": "icono de enlace externo",
  "385": "Ver un ejemplo en Github",
  "386": "icono de enlace externo",
  "387": "Ver un ejemplo en Github",
  "388": "icono de enlace externo",
  "389": "Ver un ejemplo en Github",
  "390": "icono de enlace externo",
  "391": "Mira mis creaciones visuales en Codepen",
  "392": "Instantánea del perfil de Codepen",
  "393": "logotipo de Codepen",
  "394": "Ver fragmento de código en mi perfil de Github",
  "395": "icono de enlace externo",
  "396": "Ver fragmento de código en mi perfil de Github",
  "397": "icono de enlace externo",
  "398": "Ver fragmento de código en mi perfil de Github",
  "399": "icono de enlace externo",
  "400": "Haz clic y juega el juego",
  "401": "Adivina el país por la bandera",
  "402": "Detalles técnicos...",
  "403": "Icono de signo de interrogación",
  "404": "Haz clic y prueba la aplicación",
  "405": "Imagen de la aplicación Administrador de tareas",
  "406": "Detalles técnicos...",
  "407": "Icono de signo de interrogación",
  "408": "Ir a la aplicación",
  "409": "Imagen de la aplicación Stenographer",
  "410": "Detalles técnicos...",
  "411": "Icono de signo de interrogación",
  "412": "Haz clic y juega el juego",
  "413": "Imagen de la aplicación Patatap",
  "414": "Detalles técnicos...",
  "415": "Icono de signo de interrogación",
  "418": "Leer más sobre la política de privacidad,",
  "419": "Puede enviar preguntas o solicitudes relacionadas con el procesamiento de sus datos a través de",
  "420": "o envíe una carta a la siguiente dirección.",
  "421": "Muchos sitios web, como este propio sitio, se diseñan con un programa de diseño como AdobeXd o Figma y luego se convierten a código HTML5, (S)CSS y JavaScript. Se presta especial atención a un enfoque móvil primero y una división lógica del código en secciones y componentes. Puede encontrar un ejemplo de cómo se ve esto exactamente en la práctica en el código fuente de este sitio web en este",
  "422": "Sitio web de Lion Digits, por Joris Raymaekers.",
  "423": "aquí",
  "424": "asesoramiento personalizado para su presencia en la web",
  "425": "construir y administrar sitios web de Wordpress (con DIVI o WP-Bakery)",
  "426": "desarrollo de sitios web con HTML5/CSS3/JavaScript",
  "427": "aplicaciones web multiplataforma con ReactJs y React Native",
  "428": "Desarrollo de aplicaciones de servidor JavaScript con NodeJs",
  "429": "¿Tienes inclinaciones técnicas? Luego, asegúrese de desplazarse, ver algunos ejemplos y seguir los enlaces de Github al código fuente. Asegúrese de navegar a través de las creaciones destacadas en Codepen...",
  "430": "Configuración de Nginx:",
  "431": "Configuración de composición de Docker:",
  "432": "Script Bash para actualizaciones automáticas de código al servidor VPS:",
  "433": "Compilaciones automatizadas y funciones en la nube a través de Netlify/AWS:",
  "434": "Gestión de proyectos: estoy familiarizado con soluciones empresariales como Jira, pero para proyectos personales prefiero un flujo de trabajo Kanban a través de",
  "435": "Taiga",
  "436": "icono de enlace externo",
  "437": "hasta que eso también cambia.",
  "438": "Python es elogiado con razón por su elegancia y simplicidad, y es un lenguaje de programación con el que he estado experimentando cada vez más:",
  "439": "ejemplos en Github",
  "440": "icono de enlace externo",
  "441": "Taiga.io, software de gestión de proyectos ágiles de código abierto",
  "442": "Pruebas de Python",
  "443": "Versión 1.0,",
  "444": "Versión 1.0,",
  "445": "(1983, Herk-de-Stad)",
  "446": " A continuación encontrará una descripción general de mis competencias técnicas (en un lenguaje sencillo) y los servicios a los que puede recurrir. En breve:",
  "447": "imagen de servicios digitales",
  "448": "desarrollo con nodejs",
  "449": " NodeJ es un sólido entorno de tiempo de ejecución de código abierto para JavaScript. Es un entorno muy versátil en el que crear aplicaciones que luego pueden ejecutarse en casi cualquier plataforma. JavaScript es el lenguaje de la web y, a través de NodeJs, puede usar el mismo lenguaje de programación tanto para la interfaz de usuario (UI) como para la lógica del servidor o las tareas de back-end. En combinación con TypeScript, un superconjunto de JavaScript, NodeJs le permite crear programas muy sólidos y de alto rendimiento: desde servidores web y API REST hasta aplicaciones de línea de comandos y soluciones de prueba.",
  "450": "Ejemplos recientes de proyectos de NodeJs",
  "451": " es un módulo NPM de NodeJs con una interfaz de línea de comandos que lo ayuda a traducir el texto de los archivos HTML existentes a través de la API de Google Translate y luego integrarlos y administrarlos en su sitio web utilizando archivos JSON. La interfaz CLI está construida con Commander y el análisis de elementos HTML se realiza con Node-HTML-Parser. Este programa, con la documentación que lo acompaña, está disponible como software de código abierto en el registro de NPM: ",
  "452": ".",
  "453": "Traductor de texto del sitio web",
  "454": "Consulte el módulo NPM en NPMjs.com",
  "455": "WTT",
  "456": " es un proyecto construido en NodeJs con un servidor ExpressJS, una API REST, autenticación con PassportJS y Redis para almacenamiento de sesiones. Los datos se almacenan en una base de datos MongoDB con Mongoose para el modelado de objetos (ODM). ",
  "457": " o una versión de demostración de trabajo a través de: ",
  "458": "CataCamp",
  "459": "Ver el código en Github",
  "460": "Ver en Github",
  "461": "Demo website van CataCamp",
  "462": "a través de este enlace",
  "463": "Lee el artículo completo en el sitio web de Doorbraak...",
  "464": "Correo, Texto, Teléfono, etc.",
  "465": "otras opciones...",
  "466": "Sobre mí y servicios TI",
  "467": "Soluciones digitales a medida",
  "468": " ¿Necesitas un sitio web o una aplicación? ¿Buscas un hombre de TI freelance? Aquí lo encontrarás!",
  "469": "Sobre mí y servicios TI",
  "470": "Qué puedo hacer por ti...",
  "471": " Desarrollo de aplicaciones web con perfectas píxeles y especial atención a las mejores prácticas, privacidad y seguridad.",
  "472": " Programación freelance con las herramientas de la web: HTML, CSS, JavaScript, ReactJs, React Native y NodeJs (o Python).",
  "473": " Análisis, ayuda y asesoramiento para su presencia en la web: TI como palanca para aumentar el impacto de tu negocio.",
  "474": "vídeo de demostración",
  "475": "vídeo de demostración",
  "476": "vídeo de demostración",
  "477": "Signal",
  "478": " La forma más sencilla de enviar mensajes cifrados es usando la ",
  "479": ". Esta aplicación de mensajería gratuita y de código abierto ofrece cifrado de extremo a extremo para enviar mensajes, fotos, videos y llamadas. Signal solo solicita tu número de teléfono cuando te registras por primera vez en el servicio. No se almacenan metadatos sobre la comunicación. La aplicación también permite que los mensajes se eliminen automáticamente una vez leídos.",
  "480": "Añádeme como contacto en Signal",
  "481": "ProtonMail",
  "482": "Correo electrónico",
  "483": "PGP: Pretty Good Privacy",
  "484": " Este sitio web utiliza cookies para proporcionar una experiencia óptima. ",
  "485": "Más información...",
  "486": "Entendido",
  "487": "icono de negocio",
  "488": "icono de llave",
  "489": "Icono de red Tor",
  "490": "URL del servicio Onion",
  "491": "Mateo 6",
  "492": "9 Vosotros pues, oraréis así: Padre nuestro que estás en los cielos, santificado sea tu nombre. 10 Venga tu reino. Sea hecha tu voluntad, como en el cielo, así también en la tierra. 11 Danos hoy nuestro pan cotidiano. 12 Y perdónanos nuestras deudas, como también nosotros perdonamos á nuestros deudores. 13 Y no nos metas en tentación, mas líbranos del mal: porque tuyo es el reino, y el poder, y la gloria, por todos los siglos. Amén.",
  "493": "Lo que comenzó como un pasatiempo de configurar juegos y reparar ordenadores y teléfonos ahora ha evolucionado hasta convertirse en la creación de aplicaciones web completas.",
  "494": " Pero no trabajo con ordenadores solo por mi cuenta. Obtengo la mayor satisfacción y placer al ayudar a otros a aliviar sus preocupaciones y afrontar sus retos de TI.",
  "495": " Además de mi trabajo en la web, también me fascina la criptografía y las posibles aplicaciones con claves digitales para la seguridad o nuevas formas de dinero y pagos como",
  "496": "Enlace al libro blanco de bitcoin de Satoshi Nakamoto",
  "497": "bitcóin",
  "498": ". De ahí las referencias a cosas como Pretty Good Privacy o TOR que encontrarás al final de esta página.",
  "499": " Pero el mundo digital no lo es todo y ya se dijo hace tiempo: ",
  "500": ". Por eso, en mi tiempo libre me encontrarás regularmente paseando por la naturaleza con el perro y el entrenamiento de fuerza me mantiene en forma y fuerte. A veces también me gusta chutar una pelota.",
  "501": "Una mente sana en un cuerpo sano",
  "502": " En un capítulo anterior estuve activo como empleado de logística; el amor me llevó luego a Cataluña; y un Master en Política Comparada me llevó a un episodio en el periodismo. Para aquellos a los que les gusta leer y, como yo, tienen un gran corazón por Cataluña, a continuación encontrarán una selección de publicaciones mías de antaño:",
  "503": "Casa de las Pinchas, Barcelona",
  "504": " Los deberes de los catalanes (Parte I)",
  "505": " Joris Raymaekers, uno de nuestros empleados de Doorbraak en Barcelona, mide la temperatura política en Cataluña.",
  "506": "doorbraak.be/het-huiswerk-van-de-catalanen",
  "507": "Parlamento de Cataluña, hemiciclo",
  "508": " Los deberes de los catalanes (Parte II)",
  "509": " El actual proceso catalán de transición nacional está transformando gradualmente el panorama político catalán.",
  "510": "doorbraak.be/het-huiswerk-van-de-catalanen-0/",
  "511": "Ejemplos de proyectos exitosos con clientes satisfechos..."
}
