{
  "100": "Terms and Conditions",
  "101": "Privacy Policy",
  "102": "Encrypted communication",
  "103": "You can send me standard (e-mail) messages as well as encrypted messages. The most user-friendly way to send me",
  "104": "encrypted",
  "105": "is via the",
  "106": "Signal Messenger App",
  "107": "Do you use",
  "108": "ProtonMail",
  "109": "for your email, just like me? Then you don't have to do anything special, your messages are automatically encrypted.",
  "110": "If you use another e-mail service provider, you can use my public key to encrypt a message. The 16 digits you see on the homepage is a",
  "111": "digital fingerprint",
  "112": "The full public key can be downloaded below or copied via the clipboard.",
  "113": "Not familiar with PGP? Want to learn more about encrypting messages or files?",
  "114": "Read",
  "115": "an introduction here",
  "116": "Or book an appointment with me and I will help you on your way.",
  "117": "Download Public Key",
  "118": "Copy Public Key",
  "119": "TOR support",
  "120": "This website is also available through the TOR network (The Onion Router). Connections via TOR make it very difficult to find out your location and identity. You gain privacy, but the loading of the site may be slower.",
  "121": "To connect via Tor you use a special browser,",
  "122": "Tor Browser",
  "123": ", or a browser with built-in support for Onion addresses such as",
  "124": "Brave Browser",
  "125": "The link to Lion Digits is:",
  "126": "This site can also be reached via a Tor Onion URL:",
  "127": "Lion Digits logo",
  "128": "Enterprise number",
  "129": "Email Joris Raymaekers",
  "130": "Email icon",
  "131": "Call me from Belgium",
  "132": "Phone Belgium icon",
  "133": "Call me from Spain",
  "134": "Phone Spain icon",
  "135": "Contact me via the Signal Messenger App",
  "136": "Signal Messenger App logo",
  "137": "Contact me via Skype",
  "138": "Skype logo",
  "139": "View my profile on Linked-In",
  "140": "Linked-In logo",
  "141": "View my profile on Twitter",
  "142": "Twitter logo",
  "143": "Check out the code I'm writing on Github",
  "144": "Github logo",
  "145": "Check out my visual creations on Codepen",
  "146": "Codepen logo",
  "147": "Copy to clipboard",
  "148": "Copy to clipboard icon",
  "149": "What is this?",
  "150": "Question mark icon",
  "152": "Signal Messenger App logo",
  "153": "external link icon",
  "154": "PGP introduction article",
  "155": "external link icon",
  "156": "download icon",
  "157": "Copy to clipboard icon",
  "158": "external link icon",
  "159": "external link icon",
  "160": "Book an appointment",
  "161": "Lion Digits logo",
  "162": "Translate icon",
  "163": "Terms and Conditions",
  "164": "Last updated on 01-03-2022",
  "165": "Download the Lion Digits terms and conditions here:",
  "166": "Download Terms and Conditions",
  "167": "On this page you can read about the terms and conditions of Lion Digits. The descriptions on this page are indicative. Download the full terms and conditions for a complete overview.",
  "168": "Company details",
  "169": "Lion Digits: ICT consultant and developer of websites, web applications and software, and graphic design with registered office at:",
  "170": "and company number:",
  "171": "Offers",
  "172": "All quotations and offers by Lion Digits are entirely without obligation with regard to the client.",
  "173": "Advice, proposals and quotations made by Lion Digits are personally addressed to the client. Without the permission of Lion Digits, it is not permitted to provide these for inspection to other parties or to use them other than to assess the offer.",
  "174": "Lion Digits is only bound by the offers if the acceptance thereof is confirmed in writing by the client within 14 days.",
  "175": "An agreement is concluded as soon as the offer is signed by the client and received by Lion Digits, and as soon as the advance payment of 25% of the total amount has been received.",
  "176": "Only if it is stated on the quotation that no advance payment is expected, the agreement will be concluded as soon as the quotation has been signed by the client.",
  "177": "Guarantee",
  "178": "A warranty period of 30 calendar days starts after the delivery of a project. This warranty period allows to solve errors or bugs within the quotation.",
  "179": "The right to warranty lapses if the customer wishes to access an account that can make structural changes to the website or to the code, such as a superuser account of a website, access to the core file system by means of (S)FTP or access with write rights to the database systems used.",
  "180": "Additional guarantees can be determined within the framework of a maintenance contract.",
  "181": "Liabilities",
  "182": "In the event of an attributable shortcoming in the fulfillment of the agreement, Lion Digits is only liable for replacement compensation up to the invoice amount. Any liability of Lion Digits for any other form of damage is excluded, including compensation for indirect damage, consequential damage or damage due to loss of turnover or profit.",
  "183": "Prices",
  "184": "All prices quoted are exclusive of VAT, unless expressly stated otherwise.",
  "185": "Extra wishes of the client that have not been agreed in advance will result in additional work for which Lion Digits will have to be compensated proportionally.",
  "186": "All prices are indexed annually, unless agreed otherwise in writing between the parties.",
  "187": "Payment",
  "188": "After completion of the assignment, Lion Digits will send an invoice for the amount involved in the agreement, less any previously paid advance payment. The client must pay the amount due within 14 days after the invoice date.",
  "189": "If the client has exceeded the payment term, Lion Digits will send a reminder for payment. The costs of a reminder, worth € 30 excluding VAT, will be charged to the client.",
  "190": "If the client has not fulfilled his obligations within 14 days after sending the first reminder, the collection will be outsourced. All costs resulting from this are for the account of the client. If it concerns a website or other online services, these will also be taken offline after the same exceeding period of 14 days. Costs for possibly bringing the website back online afterwards are entirely for the client.",
  "191": "Privacy",
  "192": "Lion Digits collects and processes the personal data and company data it receives from the client for the purpose of the execution of the agreement, customer management, purchases, accounting and direct marketing activities. The legal grounds are the performance of an agreement, the fulfillment of legal and regulatory obligations and/or the legitimate interest.",
  "194": "← Home",
  "195": "download icon",
  "196": "Read the privacy policy",
  "199": "Hey, watch out!",
  "200": "You shouldn't be here...",
  "201": "back",
  "204": "New Title Here.",
  "205": "Your website is the way to more customers and revenue",
  "206": "with Lion Digits you go faster and further.",
  "207": "book an appointment",
  "208": "Pixel-perfect web app development with emphasis on best practices in HTML5 / CSS3 / JS / ReactJS Native and more.",
  "209": "Building powerful, custom Wordpress content management systems & e-commerce webshops.",
  "210": "Performance and SEO optimization for faster loading, more conversions and optimal search performance",
  "211": "Smart entrepreneurs",
  "212": "are well aware of the importance of a well-designed web presence, how that presence can appeal to their target audience and convert the resulting leads into",
  "213": "additional revenue",
  "214": "has extensive experience in creating relevant and user-friendly web applications and likes to help entrepreneurs exceed their goals. Get in touch and book a free online consultation right away.",
  "215": "Interested? Book an appointment",
  "216": "Immediately book a free meeting online to explore how we can best work together.",
  "217": "book an appointment",
  "218": "Want to know more about who I am?",
  "219": "Looking for technical skills in JavaScript, TypeScript, NodeJs, ReactJs and more...?",
  "220": "Read more...",
  "221": "Examples of things we've already made...",
  "222": "Web application for listing camping sites in Catalonia. This project covers the entire 'web stack': a backend API, a desktop web app and a mobile app for iOS and Android.",
  "223": "live website",
  "224": "technical file",
  "225": "A new website was built for the beer brand Goudster from Halen, with a handy overview of the brewery's long history and a module for ordering online.",
  "226": "live website",
  "227": "The customer base of Brasserie Lemmensmolen in Beverlo got a boost after launching an elegant website with an online reservation module.",
  "228": "live website",
  "229": "Showcase website for travel agency Clear View Escape",
  "230": "live website",
  "231": "technical file",
  "232": "Interested? Make an appointment",
  "233": "Immediately book a free meeting online to explore how we can best work together.",
  "234": "book an appointment",
  "235": "Triangle icon",
  "236": "Pyramid icon",
  "237": "Hourglass icon",
  "238": "Photo of Joris Raymaekers",
  "239": "JavaScript logo",
  "240": "JavaScript",
  "241": "ReactJs logo",
  "242": "ReactJs",
  "243": "TypeScript logo",
  "244": "TypeScript",
  "245": "NodeJs logo",
  "246": "NodeJs",
  "247": "Demo video of the Catacamp website",
  "248": "Demo video of the Catacamp website",
  "249": "Visit the Catacamp website",
  "250": "catacamp logo",
  "251": "external link icon",
  "252": "View the code on GitHub",
  "253": "Github logo",
  "254": "Demo video of the Goudster website",
  "255": "Demo video of the Goudster website",
  "256": "Visit the Goudster website",
  "257": "Goudster logo",
  "258": "external link icon",
  "259": "Home page of Brasserie Lemmensmolen",
  "260": "Home page of Brasserie Lemmensmolen",
  "261": "Visit the website of Brasserie Lemmensmolen",
  "262": "Lemmensmolen logo",
  "263": "external link icon",
  "264": "Demo video of the Travel Agency website",
  "265": "Demo video of the Travel Agency website",
  "266": "Visit the Clear View Escape website",
  "267": "Clear View Escape logo",
  "268": "external link icon",
  "269": "View the code on Github",
  "270": "Github logo",
  "272": "Lion Digits, web development",
  "273": "Privacy Policy",
  "274": "Last updated on 01-03-2022",
  "275": "| General provisions",
  "276": "On this page you can read what data is collected when you use this website or interact with Lion Digits, why this data is collected and how it improves your user experience.",
  "277": "This privacy policy applies to the services of Lion Digits. Lion Digits cannot be held responsible for the privacy practices of other sites and resources you come into contact with through this website.",
  "278": "By using this website or communicating with Lion Digits, you indicate acceptance of this privacy policy.",
  "279": "Communication",
  "280": "When you send e-mail or other messages to us, we may retain those messages. Note that some (customer) data must be kept for administrative, legal or security purposes. Sometimes you will be asked for additional personal information that is relevant to the situation in question. This makes it possible to process your questions and answer your requests. This data is stored on Lion Digits' own secure servers or those of a third party.",
  "281": "Cookies",
  "282": "Functional cookies",
  "283": "This website uses \"cookies\", small text files that are placed on your computer to help the website function better and faster. For example, to remember the language choice.",
  "284": "Most browsers are set to accept cookies by default, but you can reset your browser to refuse all cookies or to indicate when a cookie is being sent. However, some features and services on this and other websites may not function properly if cookies are disabled in your browser.",
  "285": "Analytical cookies",
  "286": "Cookies can also be used to analyze how users use the site. The information generated by the cookie about your use of the website may be transferred to Lion Digits' own secure server or that of a third party. This information is used to keep track of how you use the website and to compile reports on website activity.",
  "287": "This information will only be used for the purposes described in this privacy policy.",
  "288": "Embedded content from other sites",
  "289": "Information on this site may contain embedded content (e.g. videos, images, messages, etc.). Embedded content from other sites behaves exactly the same as if the visitor had visited this other site. These sites may collect data about you, use cookies, embed additional third-party tracking, and monitor your interaction with that embedded content, including recording interactions with the embedded content on this site.",
  "290": "Access personal information and contact details",
  "291": "All visitors have the opportunity to view, change, or delete all personal information provided to Lion Digits.",
  "292": "e-mail",
  "293": "← Home",
  "296": "About me...",
  "297": "Joris Raymaekers",
  "298": "My first experience with computers and computer code came from fixing petulant video games in the MS-DOS command line,",
  "299": "see for yourself how it was in those days...",
  "300": "In a next chapter I was active as a logistics employee; love then brought me to Catalonia; and a Masters in Comparative Politics led to an episode in journalism:",
  "301": "Books, roses and freedom (in Dutch only)",
  "302": "A day through the streets of Barcelona to measure the temperature of the Catalan political process.",
  "303": "doorbraak.be/boeken-rozen-en-vrijheid",
  "304": "But I get the most benefit and the greatest pleasure from helping others alleviate their IT concerns. So, what once started with configuring games, repairing PC's and mobile phones, has now evolved into building complete web apps.",
  "305": "Developing technology and using it as a lever to increase your personal or business impact is something I am very happy to help with.",
  "306": "...trivia",
  "307": "Type 'hobby' and find out what I like to do when I'm not at a computer. Just start typing and see what happens...",
  "308": "Tap 4 times and find out what I like to do when I'm not at a computer.",
  "309": "Tech skills",
  "310": "What I can do for you.",
  "311": "Below you will find an overview of my technical skills (in plain language). Are you technically inclined? Then follow the Github links to the source code and be sure to browse through the featured creations on Codepen...",
  "312": "From design to code",
  "313": "front-end development",
  "314": "Github-pagina",
  "315": "Development (sometimes) goes faster if you can build on the work of others. Libraries I'm familiar with:",
  "316": "example",
  "317": "example",
  "318": "example",
  "319": "Managing and optimizing all that code is usually done with one of the following tools:",
  "320": "example",
  "321": "Layouts and visual animations can be done in almost all possible configurations. A selection of examples and experiments can be found on my Codepen:",
  "322": "Codepen front-end mini-projects",
  "323": "Collections include: forms with client-side validation, image galleries with DOM element filtering, modals, and CSS animations",
  "324": "Codepen Profile",
  "325": "Single page en cross-platform (web) apps",
  "326": "development with ReactJs",
  "327": "[Description of ReactJs Skills]",
  "328": "React Native App",
  "329": "Webservers and API's",
  "330": "back-end development",
  "331": "[Description of ExpressJs skills]",
  "332": "NodeJs App",
  "333": "Server management and cloud services",
  "334": "magic behind the scenes",
  "335": "Your web app must be accessible via a server and a domain name. Configuring domain names and DNS (Domain Name Servers) with subdomains, email, SSL certificates and possibly a CDN (Content Delivery Network) is a task that belongs to every website.",
  "336": "Server management is not my main activity, but I am sufficiently familiar with setting up and maintaining virtual servers (VPS) for both NodeJs apps and Wordpress websites. I am familiar with working with tools such as Nginx (reverse proxy), PM2, SSH or Docker containers:",
  "337": "example",
  "338": "example",
  "339": "example",
  "342": "Programming languages and IDEs",
  "343": "development environment",
  "344": "Applications are developed using a development environment or IDE, Integrated Development Environment. A collection of programs and tools to write and test your code.",
  "345": "My basic configuration consists of Windows Subsystem for Linux (WSL2) and Visual Studio Code, supplemented with various extensions and plugins for, for example, Docker, formatting code (Prettier) or automatically generating suggestions (Tabnine AI).",
  "346": "I run Apple's IOS in a separate Docker container (yes, you can do that: instructions).",
  "347": "Source code management: Git, Github and Gitea (hosted on my own server).",
  "348": "Other programming languages?",
  "349": "My focus is on JavaScript and by extension TypeScript. As a web developer and Wordpress builder, you inevitably also come into contact with PHP from time to time.",
  "351": "Fun Zone",
  "352": "Okay, enough reading. Below you will find a number of mini projects and games that will keep you entertained for a while. Have fun!",
  "353": "Guess the Flag",
  "354": "Play now",
  "355": "Task Manager",
  "356": "To the app",
  "357": "Stenographer",
  "358": "To the app",
  "359": "Patatap",
  "360": "Play now",
  "361": "The player is presented with a random country flag and four possible answers. Try to choose the right one. Game state management built with ReactJs and data fetched from the REST Countries API.",
  "362": "Single page job management app with custom JSON API. Main UI function: select multiple items (shift key), delete and update a custom selection of tasks. Application built with NodeJs, Express & MongoDb. API endpoints for GET/POST/PUT/DELETE requests. AJAX requests with jQuery.",
  "363": "\"Hide a text message in an image. Encode and decode an image of your choice. Built with Python and ReactJs.",
  "364": "Tap, click or type randomly on your keyboard. Each keystroke produces a firework of randomly generated sounds and colors. Application built with PaperJs and HowlerJs libraries.",
  "365": "Interested? Make an appointment",
  "366": "Immediately book a free meeting online to explore how we can best work together.",
  "367": "Book a consultation",
  "368": "Photo of Joris Raymaekers",
  "369": "Visit the MS-DOS Games Archive",
  "370": "external link icon",
  "371": "Casa Pedrera Barcelona",
  "372": "Doorbraak logo",
  "373": "JavaScript logo",
  "374": "JavaScript",
  "375": "ReactJs logo",
  "376": "ReactJs",
  "377": "TypeScript logo",
  "378": "TypeScript",
  "379": "NodeJs logo",
  "380": "NodeJs",
  "381": "",
  "382": "external link icon",
  "383": "See an example on Github",
  "384": "external link icon",
  "385": "See an example on Github",
  "386": "external link icon",
  "387": "See an example on Github",
  "388": "external link icon",
  "389": "See an example on Github",
  "390": "external link icon",
  "391": "Check out my visual creations on Codepen",
  "392": "Codepen profile snapshot",
  "393": "Codepen logo",
  "394": "View code snippet on my Github profile",
  "395": "external link icon",
  "396": "View code snippet on my Github profile",
  "397": "external link icon",
  "398": "View code snippet on my Github profile",
  "399": "external link icon",
  "400": "Click and play the game",
  "401": "Guess the country from the flag",
  "402": "Technical details...",
  "403": "Question mark icon",
  "404": "Click and try the app",
  "405": "Image of the Task Manager app",
  "406": "Technical details...",
  "407": "Question mark icon",
  "408": "To the app",
  "409": "Image from the Stenographer app",
  "410": "Technical details...",
  "411": "Question mark icon",
  "412": "Click and play the game",
  "413": "Image of the Patatap app",
  "414": "Technical details...",
  "415": "Question mark icon",
  "418": "Read more about the privacy policy,",
  "419": "You can send questions or requests regarding the processing of your data via",
  "420": "or send a letter to the address below.",
  "421": "Many websites, such as this very own site, are designed with a design program such as AdobeXd or Figma and then converted to HTML5, (S)CSS and JavaScript code. Particular attention is paid to a mobile-first approach and a logical division of the code into sections and components. An example of exactly what this looks like in practice can be found in the source code for this website at this",
  "422": "Website of Lion Digits, by Joris Raymaekers.",
  "423": "here",
  "424": "tailored advice for your web presence",
  "425": "building and managing Wordpress websites (with DIVI or WP-Bakery)",
  "426": "website development with HTML5/CSS3/JavaScript",
  "427": "cross platform web apps with ReactJs and React Native",
  "428": "JavaScript server app development with NodeJs",
  "429": "Are you technically inclined? Then be sure to scroll on, check out some examples and follow the Github links to the source code. Be sure to browse through the featured creations on Codepen...",
  "430": "Nginx configuration:",
  "431": "Docker Compose configuration:",
  "432": "Bash script for automatic code updates to VPS server:",
  "433": "Automated builds and cloud functions via Netlify/AWS:",
  "434": "Project management: I am familiar with Enterprise solutions such as Jira but for personal projects I prefer a Kanban workflow via",
  "435": "Taiga",
  "436": "external link icon",
  "437": "until that too changes.",
  "438": "Python is rightly praised for its elegance and simplicity, and it's a programming language I've been experimenting with more and more:",
  "439": "examples on Github",
  "440": "external link icon",
  "441": "Taiga.io, open source agile project management software",
  "442": "Python tryouts",
  "443": "Version 1.0,",
  "444": "Version 1.0,",
  "445": "(1983, Herk-de-Stad)"
}